{
  "title": "'Completely different, yet genuinely get on' - watch BBC correspondents on Starmer and Trump",
  "link": "https://www.bbc.com/news/videos/c9dxq447dwvo?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 16:27:49 GMT",
  "content": "President Trump arrives in the UK on Tuesday ahead of his State visit.\n\nThe BBC's Political Editor Chris Mason and North America Editor Sarah Smith discuss what's at stake for both sides during the trip.\n\nMore on this story.\nWatch: Mandelson says he regrets falling for Epstein's lies\nDeputy Prime Minister Angela Rayner has resigned after failing to pay enough tax on a flat in Hove.\nThe Reform UK leader has appeared before the US House Judiciary Committee to discuss freedom of speech and online safety laws.\nWatch: Badenoch questions Starmer on borrowing costs\nThe BBC's Damian Grammaticas explains the controversy surrounding China's mega-embassy plan.\nWatch: PM talks about his 'good personal relationship' with Trump\n\nMPs are debating the third reading of the Terminally Ill Adults (End of Life) Bill.\n\nBaroness Casey told the BBC that \"we need to reset\" the commitment to looking after children.\nWatch: Mel Stride pushed to say sorry for Liz Truss's mini-budget\nChancellor Rachel Reeves has delivered her Spending Review, setting out budgets for government departments.\nWatch: Reform UK's Sarah Pochin defends call for burka ban\nWatch: Tearful MP says she was told to 'live with' chronic UTI\nKeir Starmer apologises to Plaid Cymru's leader in Westminster for being \"overly rude\" to her.\nThe prime minister refused to set a cap on immigration but has promised it will fall “significantly”.\nFrom a recount in Runcorn to a change of council control in Staffordshire, see what's been happening so far.\nHenry Zeffman: Reform UK wins Runcorn, but what comes next?\nWatch: What's at stake in these local elections?\nWatch: Don't call civil servants 'pen-pushers', says Sue Gray\nMel Stride says Rachel Reeves is responsible for the UK's growth estimate for 2025 being halved.\nHenry Zeffman explains what you need to know about the Spring Statement.\n\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7ab7/live/1f060ef0-92fc-11f0-9cf6-cbf3e73ce2b9.jpg"
}