{
  "title": "'The bombing has been insane': Palestinians scramble to flee Israeli assault on Gaza City",
  "link": "https://www.bbc.com/news/articles/cly0qnnx5w5o?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 15:42:06 GMT",
  "content": "Thousands of families are attempting to flee Gaza City as the Israeli military confirms it has begun ground operations that are part of its large-scale assault aimed at occupying the city. \nLina al-Maghrebi, 32, a mother of three from the city's Sheikh Radwan neighbourhood told the BBC she had resisted leaving her home - despite the danger - until she received a phone call from an Israeli officer ordering her to evacuate. \n\"I was forced to sell my jewellery to cover the cost of displacement and a tent,\" she said. \"It took us 10 hours to reach Khan Younis, and we paid 3,500 shekels (£735) for the ride. The line of cars and trucks seemed endless.\"\nIsraeli Prime Minister Benjamin Netanyahu said a \"powerful operation\" had been launched in Gaza City, which he described as Hamas's last major stronghold.\nThe Israeli military has designated al-Rashid coastal road as the only permitted route for civilians to use to evacuate. Many have described severe congestion, endless queues of cars and trucks, and long delays, with families stranded on the roadside while airstrikes continue overhead.\nThe operation has drawn widespread international condemnation, including from the UN human rights chief and German foreign minister. \nUK Foreign Secretary Yvette Cooper called the offensive \"utterly reckless and appalling\", saying it would \"only bring more bloodshed, kill more innocent civilians and endanger the remaining hostages\".\nBut US Secretary of State Marco Rubio appeared to offer tacit support for Israel's operation during a joint press conference with Netanyahu on Monday, saying the US preferred a negotiated end to the war, but that \"sometimes when you're dealing with a group of savages like Hamas, that's not possible\".\nIsrael's ramped up offensive comes as a United Nations commission of inquiry released a report on Tuesday that says Israel is committing genocide against Palestinians in Gaza. Israel categorically rejected the report.\nNivin Imad al-Din, 38, a mother of five, said she fled south after Israeli warplanes dropped evacuation leaflets in her neighbourhood, though her husband refused to leave their home.\n\"I couldn't take my furniture with me because I couldn't afford the cost of a large truck,\" she explained. \"Leaving everything behind was the hardest decision I've ever made.\"\nThe cost of displacement has surged far beyond the reach of most households. Residents said renting a small truck now costs around 3,000 shekels (£630), while a tent for five people sells for about 4,000 shekels (£840). With most families deprived of income since the war began, some are forced to walk for miles or remain in their homes despite the risks.\nOvernight into Tuesday, Israeli warplanes carried out a wave of heavy airstrikes across Gaza City, with concentrated bombardment on the central al-Daraj neighbourhood, the Beach refugee camp in the west, and Sheikh Radwan in the north.\nThe attacks were accompanied by artillery fire, drone fire and helicopter gunship activity. \nThe Israel Defense Forces said it was \"gradually\" moving into Gaza City as part of the \"next phase\" of its offensive.\nIt said air and ground forces would be part of this next stage of the military's operation, with the number of troops increasing day-by-day.\nResidents described the overnight strikes as \"hell\". \nGhazi al-Aloul, a displaced resident from northern Gaza, told the BBC he is now sleeping at the entrance of al-Quds Hospital in Tel al-Hawa, southwest Gaza. \n\"I did not choose this,\" he said. \"I was forced after leaving the home where my family and I had been sheltering for nearly a month after fleeing the north\".\n\"The bombardment has been insane for hours, and the army is threatening to demolish several residential buildings in the area.\" \nSami Abu Dalal, from al-Daraj in central Gaza, described the night as \"extremely difficult\".\n\"Whole residential blocks were levelled on top of their inhabitants, leaving many dead, missing, or injured,\" he said.\nHe said Israel was advancing on three fronts - and was accompanied by the use of booby-trapped vehicles, intense airstrikes, and heavy shelling. Meanwhile, Apache helicopters hovered over different parts of the city, firing continuously.\nA new report accuses Israel of committing genocide in Gaza, in \"the strongest and most authoritative UN finding to date\". \nMarco Rubio was a guest of honour at contentious tunnel excavated under Palestinian homes in occupied East Jerusalem.\nAt a joint press conference with US Secretary of State Marco Rubio, Netanyahu said every country had the right \"to defend itself beyond its borders\".\nBBC diplomatic correspondent Paul Adams looks at parallels between reactions to Israel and apartheid-era South Africa. \nThe Scottish government has committed to supporting the treatment of up to 20 Palestinian youngsters.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0cf9/live/10ad6740-92de-11f0-950e-eb051178bae0.jpg"
}