{
  "title": "'You feel a bit invincible': Triathlete's warning to fellow students over signs of sepsis",
  "link": "https://www.bbc.com/news/articles/cr70zr51rmeo?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 05:13:59 GMT",
  "content": "A triathlete is ready to face life with no limbs after they were all amputated as she fought sepsis.\nCardiff University medical student Lily McGarry, from Jersey, believed she was experiencing a bout of \"freshers' flu\".\nBut after being taken to hospital, the 24-year-old suffered two heart attacks and fell into a coma, with the next three months a complete blank. \nThe life-threatening condition, where the body's response to an infection damages tissues and organs is not yet clearly understood and can affect anyone, of any age, according to the UK Sepsis Trust. \n\"When you're young you think, as I did, that these kind of conditions don't affect you,\" said Lily. \n\"You feel a bit invincible, and you don't want to worry about your health because you've got a social life to live.\"\nDescribed by her friends as \"a fantastic sportswoman\", Lily was passionate about swimming, running and being at the beach. \nBut as she lies in her bed at Cardiff's Llandough Hospital, she remembers the day her normal student lifestyle was turned upside down, and contemplates how she can return to an active lifestyle.\n\"I felt a bit under the weather, but I was still going about my daily life,\" she said. \n\"I was sat at home with my housemates at uni.\n\"Then I watched Gavin and Stacey all day sat on the sofa.\"\nThis was on 14 January, and she decided to go to bed at about 23:00, adding: \"I just thought I'd have a rest and sleep it off.\"\nBut as the night went on, Lily's condition deteriorated.\nShe added: \"My housemate saw my light was still on when she got up in the night, and came to see me. \n\"I was sick everywhere and had been incontinent.\"\nHer friends Lucy and Ella cleaned her up and took her to A&E, at which point she noticed a rash that was starting to spread on her body. \nLily was taken to the resuscitation area, and was still not fully aware of the seriousness of her condition, adding: \"I was able to walk into A&E and so at that point I thought I'd just receive some antibiotics and go home the next day. \n\"But in resus I remember the consultant asking for my mum and dad's mobile numbers.\"\nApart from being in a room surrounded by doctors and nurses, she remembers very little after this, until about three months later in April. \nLily did not even know she had suffered a cardiac arrest, and describes it as \"quite surreal\" finding out about this from a post her sister had written.\n\"I don't think I really realised the scale of what had happened until about May when I was starting to look at my body,\" she added. \n\"I've been told I quickly went into septic shock.\n\"My blood pressure was very low and within 24 hours I'd had two cardiac arrests and was diagnosed with meningococcal septicaemia.\"\nSepsis occurs when the body responds improperly to infection, causing the organs to work poorly. \nIt can cause a dramatic drop in blood pressure and damage the lungs, kidneys, liver and other organs.\nAccording to UK Sepsis Trust, one of the key challenges in identifying sepsis is that it can present very differently in each patient.\nThere are six key symptoms to look out for:\nS - slurred speech or confusion\nE - extreme pain in muscles and joints\nP - passing no urine in a day\nS - severe breathlessness\nI - people saying \"it feels like I'm going to die\"\nS - skin that's mottled, discoloured or very pale\n\"I'm fortunate to have lost my limbs in an age where there's lots of technology,\" Lily said. \nShe is considering devices such as hand cycles, adding: \"I've always liked swimming and being in the water and I'm really excited about the sense of freedom I'll have without gravity in the water.\n\"So I hope that can happen soon.\"\nLily will head back to Jersey in November, and is looking forward to seeing her grandparents, going to the beach and to \"recuperate and reflect on what's happened\".\nFriends and family are also raising money to help give her as many opportunities as possible, and she describes feeling emotional about support from Wales, Jersey and further afield. \nHousemate Ella Jennings described how compassionate and caring she is, and how Lily would go out of her way to help others.\n\"Since she's got poorly she's just that and more, she's so positive,\" Ella added.\n\"Every time I see her she's making more progress and thinking about the future, she's so determined. \nShe's still the same Lily asking about everyone else and caring about everyone else.\n\"Honestly she blows my mind, every time I see her, she astounds me with her attitude and her outlook on life.\"\nIona Fyfe - Scots singer of the year in 2018 - is carried on the back of a bull mascot at the official ceremony.\nRory Timmins supported his seriously ill wife and daughter while studying at University of Worcester.\nCraig Myall, 36, spent nearly five months in hospital after developing life-threatening sepsis.\nA sepsis survivor is completing the last leg of a 102-mile (164km) walk to raise funds for research.\nLucy Howlett says her dad, who died from sepsis last year, encouraged her to start her own business.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1e82/live/c6eb4fe0-92ed-11f0-b391-6936825093bd.jpg"
}