{
  "title": "Bowen: UN commission report on genocide is blunt indictment of Israel's actions in Gaza",
  "link": "https://www.bbc.com/news/articles/c0m4rxjppl8o?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 07:01:46 GMT",
  "content": "The report is intended to be detailed and damning, presenting evidence it says shows that Israel is committing genocide in Gaza. It says that Israel has breached the Genocide Convention that was passed in 1948 by the newly established United Nations. The word genocide, and the convention that defined it as a crime, were directly inspired by the genocide of six million Jews by Nazi Germany.\nIsrael denies all allegations that its conduct in Gaza has broken the treaties and conventions that make up the laws of war and international humanitarian law. It justifies its actions as self-defence, in protection of its citizens and to force the release of the hostages taken by Hamas and Islamic Jihad on 7 October 2023, around 20 of whom are believed still to be alive.\nThe Israelis have dismissed the report as antisemitic lies inspired by Hamas. It was compiled by a commission of inquiry set up by the UN Human Rights Council. Israel and the US are boycotting the Council, which both countries say is biased against them.\nBut the findings of the report will feed into the growing international condemnation of Israel's conduct, which is also coming from Israel's traditional western allies as well as the Gulf Arab monarchies that normalised relations with Israel in the Abraham Accords.\nNext week at the UN General Assembly in New York, the United Kingdom, France, Australia, Canada and others are due to join the majority of UN members by recognising the sovereignty of an independent Palestinian state.\nThe move will be more than symbolic. It will change the debate about the future of the conflict that began more than a century ago when Zionist Jews from Europe came to settle in Palestine. Benjamin Netanyahu, Israel's prime minister, has condemned recognition as antisemitic, and a reward for Hamas terrorism.\nHe says the Palestinians will never have independence in any part of the land between the river Jordan and the Mediterranean Sea, as a Palestinian state would put Israelis in danger. Israeli religious nationalists believe the land was granted to the Jewish people alone by God.\nGenocide is defined in the 1948 convention, as the intent to destroy, in whole or in part, a national, ethnical, racial or religious group – in this case, Palestinians in Gaza.\nThe report details actions against Palestinians inside Gaza and in jails inside Israel.\nAmong a long list of accusations is Israeli targeting of civilians that it has a legal obligation to protect, and the imposition of \"inhumane conditions causing the death of Palestinians, including the deprivation of food, water and medicines\". That is a reference to the blockade that has produced a famine as well as widespread starvation, according to the IPC, the international body that assesses food emergencies.\nThe new UN report also details forced displacement, currently happening in Gaza City after the Israeli military, the IDF, ordered all civilians there to move south. Around one million people are believed to be affected. Israel's offensive is gathering pace, with air strikes and the destruction of many buildings, including high rises that are symbols of Gaza City, which the IDF calls Hamas \"terror towers\". \nThe report also says that Israel has imposed \"measures intended to prevent births\". That refers to an attack on Gaza's largest fertility clinic that reportedly destroyed around 4000 embryos and 1000 sperm samples and unfertilised eggs.\nAs well as the results of military action, the UN report singles out three Israeli officials for inciting genocide.\nThey are Yoav Gallant, then the defence minister, who said on 9 October 2023 that Israel was fighting \"human animals\". Like Prime Minister Netanyahu, Gallant already faces an arrest warrant for war crimes from the International Criminal Court.\nNetanyahu is also accused of incitement by comparing the Gaza war to the story of the Jewish fight against an enemy known as Amalek. In the bible God tells the Jewish people to eliminate all the Amalek men, women and children, as well as their possessions and their animals.\nThe third official singled out is President Isaac Herzog, who in the first week of the war condemned Gaza's Palestinians for not rising up against Hamas. He said on 13 October 2023 that \"it's an entire nation out there that is responsible\".\nLegally, it is hard to prove the crime of genocide. The people who framed the Genocide Convention, and interpretations made by the ICJ in more recent cases deliberately set a high legal bar.\nAt the International Court of Justice in The Hague, South Africa has brought a case that Israel has committed genocide against the Palestinians. It will take several years for the case to be adjudicated.\nBut with the war in Gaza continuing and perhaps escalating further with the current Israeli offensive, the UN report is going to deepen international divisions about the war.\nOn one side are countries who demand an immediate end to the killing and destruction in Gaza, and condemn the famine caused by Israel's siege. They include the UK and France.\nOn the other are Israel, and the United States. The administration of President Donald Trump continues to provide vital military aid and diplomatic cover without which the Israelis would struggle to continue the war in Gaza and its bombing campaigns elsewhere in the Middle East.\nThe panel finds that four of the five genocidal acts defined under international law have been carried out against Palestinians during the war.\nThe conflict between Israel and the Palestinian people is one of the longest-running in the world.\nMarco Rubio was a guest of honour at contentious tunnel excavated under Palestinian homes in occupied East Jerusalem.\nAt a joint press conference with US Secretary of State Marco Rubio, Netanyahu said every country had the right \"to defend itself beyond its borders\".\nBBC diplomatic correspondent Paul Adams looks at parallels between reactions to Israel and apartheid-era South Africa. \nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a0c2/live/ba645b50-9319-11f0-b391-6936825093bd.jpg"
}