{
  "title": "Deal is done to keep TikTok in the US, says Trump",
  "link": "https://www.bbc.com/news/articles/c7847q9xvwgo?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 14:12:26 GMT",
  "content": "A deal has been made between the US and China to keep TikTok running in the US, according to the US President Donald Trump.\n\"We have a deal on TikTok, I've reached a deal with China, I'm going to speak to President Xi on Friday to confirm everything up,\" Trump told reporters as he left the White House for a state visit to the UK.\nThe social media platform, which is run by Chinese company ByteDance, was told it had to sell its US operations or risk being shut down.\nHowever, Trump has repeatedly delayed the ban since it was first announced in January.\nThe US president said a buyer will be announced soon. \nCNBC reported the deal would include a mix of current and new investors, and would be completed in the next 30 to 45 days.\nIt also said US tech company Oracle would keep its existing agreement to host TikTok serves inside the US.\nThat had been one of the main concerns of American lawmakers, who cited concerns over data being shared with China on national security grounds.\nOn Monday, a US trade delegation said it had reached a \"framework\" deal with China amid wider trade negotiations in Madrid. \nChina confirmed a framework agreement but said no deal would be made at the expense of their firms' interests.\nAfter the talks, Wang Jingtao, deputy head of China's cyberspace administration, suggested in a press conference the agreement included \"licensing the algorithm and other intellectual property rights\".\nHe added: \"The Chinese government will, according to law, examine and approve relevant matters involving TikTok, such as the export of technology as well as the license use of intellectual property.\"\nAfter initially calling for TikTok to be banned during his first term, Trump has reversed his stance on the popular video-sharing platform.\nIn January, the US Supreme Court upheld a law, passed in April 2024, banning the app in the US unless its Chinese parent company ByteDance sold its US arm.\nThe US Justice Department has said that because of its access to data on American users, TikTok poses \"a national-security threat of immense depth and scale\".\nHowever, ByteDance has resisted a sale, maintaining its US operations are completely separate, and says no information is shared with the Chinese state.\nTikTok briefly went dark in January, but this lasted for less than a day before the initial ban was delayed.\nThe deadline for a sale has since been extended three times, and the latest delay to the ban is due to end on 17 September.\nSign up for our Tech Decoded newsletter to follow the world's top tech stories and trends. Outside the UK? Sign up here.\nThe senator from New Jersey crticised Patel during a hearing over what he claims have been repeated missteps as FBI director.\nThe 22-year-old man from Utah is set to appear in court on Tuesday to face formal charges over the killing.\nFor the first time in almost three decades Colombia loses its certification as a US ally in the war on drugs. \nUS President Donald Trump and his wife Melania are coming to the UK for an unprecedented second state visit.\nJudge Gregory Carro also ruled a second-degree murder charge against Mangione could stand during a hearing on Tuesday.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/11b2/live/3d8f2930-9304-11f0-a647-dff301f4a439.jpg"
}