{
  "title": "First legal challenge lodged against 'one in, one out' migrant return deal",
  "link": "https://www.bbc.com/news/articles/c1dqe2443l1o?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 16:31:25 GMT",
  "content": "An Eritrean man who arrived in the UK by small boat has launched a last-minute legal claim at the High Court to stop his removal to France on Wednesday.\nThe  25-year-old, who arrived in the UK on 12 August, was due to be returned under the new 'one in, one out' returns pilot scheme agreed between the UK and France.\nLaunching the first legal challenge against the deal in the High Court in London, his lawyers argued that there was a \"real risk of destitution\" if he was deported to France. \nKate Grange KC, for the Home Office, said he could have claimed asylum in France and that he had shown no evidence of why it was not a safe country to return to. The judge is expected to rule later today.\nPapers logged at the High Court show that the man, identified as \"NST\", left Ethiopia for Europe two years ago, arriving in Italy in April 2025.\nA month later, he left for France where he was assisted by charities including the Red Cross, before his mother paid $1,400 (£1,024) to smugglers for his Channel crossing to the UK.\nThe court heard that he told his initial screening interview with British officials that he had not been exploited and had been paid when he worked as a labourer in Libya.\nAsked why he had not sought asylum before arriving in the UK, NST said he had seen people sleeping on the streets in Europe and had concluded there was no support.\nOfficials said he should have claimed asylum there because he was not under the control of trafficking gangs.\nHowever, Sonali Naik KC, representing NST, said that the Home Office had not yet assessed whether her client was a victim of trafficking - and there had been no evaluation of whether sending him to France would leave him destitute.\nMr Justice Sheldon said that the European Court of Human Rights in Strasbourg had previously ruled that temporary rough sleeping did not amount to degrading treatment.\nThe first returns of migrants who reached the UK on small boats via the English Channel from France were expected to begin from as early as Tuesday.\nDowning Street has insisted that the removals will begin \"imminently\" - although initial plans for a flight to Paris today were put back.\nThe 'one in, one out' scheme was set up as part of a deal announced by Prime Minister Keir Starmer and French President Emmanuel Macron in July this year. Dozens of migrants have been detained since.\nOver the last fortnight, some migrants being held in immigration removal centres, received letters that said they would be put on a scheduled Air France flight departing from Heathrow Airport for Paris at 9am this morning.\nHowever, a number of sources told the BBC that some of the potential passengers had been told their departure would be deferred as further representations about their cases were made.\nIt is not unusual for immigration removals to be delayed if officials are warned by lawyers that the individual has not had a full or fair opportunity to present their case.\nUnder the new treaty, France agreed to take back adults or accompanied children who make a journey to the UK by small boat, once any asylum claim is withdrawn or declared inadmissible.\nFor each person sent back to France, the UK will accept someone with a case for protection as a refugee, who has not tried to cross the English Channel and can pass security and eligibility criteria. \nThe BBC understands that migrants living in the Calais region who have applied to the scheme have been rejected - but asylum seekers in the Paris region have been accepted.\nThe government has not confirmed how many people a week will be returned or relocated under the scheme, but former home secretary Yvette Cooper stressed that it was operating on a trial basis.\nOther factors that may have played a part in the delay include whether France is ready to receive returnees, and on the UK side, the state of security checks of any potential genuine refugees.\nThe Home Office began detaining some small boat migrants on 6 August on the basis that they were ineligible for asylum because they had spent time in a safe third country. \nUnder the scheme, officials in London refer each potential return case to French officials. The French authorities then have two weeks to respond - before beginning the process of proposing who should come to the UK in their place.\nThe scheme is one of a number of measures unveiled by the government which aim to tackle small boat crossings.\nHowever, the Conservatives have argued it will not see enough migrants deported to act as a significant deterrent.\nMinisters have not put a figure on how many people will be returned to France under the pilot.\nMore than 30,000 people have crossed the Channel in small boats so far this year. \nIt is the earliest point in a calendar year this figure has been passed since data on crossings was first reported in 2018.\nNo single male asylum seekers will be housed at the Northallerton hotel, the Home Office confirms.\nBournemouth inquest told safeguarding staff emailed concerns about Leonard Farruku's mental health.\nA number of asylum seekers moved from hotels into former student accommodation in Aberdeen.\nEpping Forest District Council is fighting to stop The Bell Hotel from housing asylum seekers.\nThe suspect was charged in connection with threatening and abusive behaviour following a demonstration near the Cladhan Hotel.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dd92/live/93f892f0-930b-11f0-9cf6-cbf3e73ce2b9.jpg"
}