{
  "title": "Former Tory minister Maria Caulfield defects to Reform",
  "link": "https://www.bbc.com/news/articles/c1wg3zx4r0qo?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 11:30:36 GMT",
  "content": "Former Conservative health minister Maria Caulfield has become the latest Tory to join Nigel Farage's Reform UK Party.\nCaulfield lost her seat to the Lib Dems at last year's general election after nearly nine years as the MP for Lewes.\nShe told GB News she joined Reform a month ago because the Conservative Party had become \"less and less what I believe in\". \nReform confirmed she has joined as a member. Caulfield is the 15th former Tory MP to join the party.\nThe latest defection comes after Danny Kruger, who sat on Tory leader Kemi Badenoch's team as a shadow work and pensions minister, became the first sitting Tory MP to defect on Monday.\nCaulfield told GB News: \"The [Reform] party needs a lot of experience of people who know the system and can talk about this.\"\n\"If you are Conservative right-minded, then the future is Reform. The country is going to change a lot,\" she said.\n\"The same people who thought that Brexit would not happen think that Reform will not happen. They are in for a shock.\"\nShe added: \"I am sad for the Conservative Party. I could see that I have not changed but the party has become less and less what I believe in.\"\nResponding to the defection, Tory leader Kemi Badenoch told broadcasters: \"Conservatives are the only party that are talking about how we need to deliver a stronger economy, living within our means, cutting welfare spending. \n\"We have got a plan to start getting growth back - Labour do not, and Reform are merely focused on Westminster bubble issues about who is in which party. \n\"That's not going to make life better for all the people out there.\"\nCaulfield is a Brexit supporter and quit her role as Tory vice chair in protest at Theresa May's 2018 attempt at a softer withdrawal from the EU, known as the Chequers deal.\nAt the time, she told May her plan would not capitalise on the opportunities of Brexit.\nShe has previously served in a number of junior ministerial roles, including as a health minister.\nHer appointment by May as minister for women in 2018 sparked a backlash from women's rights groups because of her opposition to decriminalising abortion.\nJames MacCleary, the Liberal Democrat who won Caulfield's seat in Lewes last year, said the move showed Farage \"doesn't care about our NHS\" because \"the Conservatives left our NHS on its knees\".\nHe added: \"Rather than offering solutions to the problems our country faces, Reform seems to be welcoming in the people that were responsible for causing them in the first place.\"\nThe BBC has contacted Caulfield for comment.\nSign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday.\nThe East Wiltshire MP said the Conservatives were no longer the main party of opposition.\nStephen Atkinson says Reform will \"need experience\" as high-profile former Tory MPs join the party.\nThe leader of Derbyshire County Council says the authority is \"20% overstaffed\".\nReform UK leader Guy Aston says Ros Jones “misled” the public with her pledge to reopen DSA by 2026.\nReform's leader expresses confidence in its chances of taking the Caerphilly Senedd seat from Labour.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5830/live/12ad9cb0-92e1-11f0-950e-eb051178bae0.png"
}