{
  "title": "How long can the UK afford the pension triple lock?",
  "link": "https://www.bbc.com/news/articles/c9wdgk7ggezo?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 09:04:55 GMT",
  "content": "At a weekly ballet class in Wokingham, dancers glide elegantly through an intricate series of poses, making it look easy despite ranging in age from 50 to over 80.\nFigures released on Tuesday, suggesting retirees will likely benefit from a 4.7% increase in the state pension from next April, will add a spring to those dancers' steps.\nYet concerns remain. Glenys worries about those whose only income is the basic state pension.\n\"I do feel sorry for people that are struggling, if it's food or heat,\" she says.\nMeanwhile, former architect Mary says her children's generation are having to strive harder and for longer to afford to start a family or buy a home. \n\"My daughter's about to give birth, and she's beginning to contribute to a pension. But what it's going to be like for the new grandchild, I've no idea.\"\nGlenys and Mary's reflections show not only the success of the triple lock system used to increase pensions but also raises questions around its fairness and its sustainability.\nThe triple lock formula says that the state pension will rise in spring by the greater of 2.5%, the previous September's inflation rate, or the increase in average earnings registered over the previous summer.\nBecause the earnings figure published on Tuesday morning is almost certain to be the highest of those three, it is likely the state pension will go up by 4.7% in April.\nThe measure has helped to cut the number of pensioners living in poverty, but according to the minister who launched it, Sir Steve Webb, it's not job done yet. \nThe UK's state pension is less generous than the average in rich countries, meaning we are more reliant on private savings. And the nature of the cost of living crisis of the past few years, centred on the staples like food and energy, has left those reliant on the state pension particularly stretched.\nIt could get worse for some pensioners. The triple lock means the new state pension - for those who reached pension age after April 2016 - is creeping closer to the £12,570 threshold at which tax becomes payable.\nThat threshold is set to be frozen until 2028, meaning people like former hairdresser Linda will soon likely end up paying income tax on their pension under current plans.\n\"You're given it in one hand and it's taken away in the other, so that's not a lot of good,\" she says.\n\"If they could raise the tax threshold, it would make a huge difference.\"\nThe state pension faces other issues. We are living longer and having fewer children, so the bill is booming and it is being footed by a falling share of the population.\nAlready, funding the state pension accounted for almost £140bn in the last financial year, making it the second biggest claim on the public purse after health spending. \nAnd the amount spent is vulnerable to the kind of extremes in inflation we've seen in recent years, meaning it now costs about three times as much as its architects originally reckoned.\nFuture sums threaten to be eyewatering. The government's own independent forecaster says that by 2070 the amount needed to fund the state pension will be equivalent to 7.7% of GDP - 50% higher than right now. \nThat is quite an ask of taxpayers when other claims on the public purse are also projected to soar, in particular healthcare spending - largely for the same group of older Brits.\nAs the costs mount, many economists say the triple lock might disappear. Keeping it going means shifting an increasing amount of resources from younger generations, workers and business owners, to older ones.\nThe government has committed to keeping it in place for the rest of the parliament, but Pensions Minister Torsten Bell admitted in a previous role - as chief executive of the Resolution Foundation, a think tank that focuses on the plight of the lower paid - that the triple lock is a \"messy tool\".\nSo what should replace it? In his previous job, Bell touted a system of increases that was shielded from spikes in inflation. \nWebb, who acknowledges the triple lock can't continue \"infinitely\", has mentioned a system of getting the pension to a certain proportion of average earnings – and then maintaining that. \nOthers have floated the idea of linking it to inflation or earnings increases.\n\nThe question is whether politicians would do any of this. The scrutiny in the run-up to the last election on the triple lock, and the row over the winter fuel payment, underscores what a sensitive topic pensioners' finances are with voters.\nThat is not just the case with current retirees. \nShortly after speaking to Linda, Glenys and Mary, we visited a board game night in Reading where players were mainly in their 20s and 30s. They pointed out that pensioners can still find it a struggle to afford the basics and, crucially, they themselves know that this is the scheme that they will have to rely on in some form.\nSmall wonder that most politicians shy away from the issue where they can.\nThere is an alternative, but not an enticing one. The Institute for Fiscal Studies reckons that we'd have to work until 74 to keep a lid on state pension spending.\nNo-one said getting older was easy.\nAbout nine million pensioners will get the winter fuel payment this year, after a government U-turn.\nOfficial data shows the number of people who received winter fuel payments after now-reversed government cuts.\nEarnings figures for the three months to July are used for the yearly increase.\nThe triple lock guarantees that the state pension is not overtaken by inflation or wage increases.\nChancellor Rachel Reeves will set out her economic plans in her second Budget on 26 November.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c07a/live/b2ce65e0-92cc-11f0-a72d-3fad567a173a.jpg"
}