{
  "title": "Inside the century-old Bank of England building that houses 400k gold bars",
  "link": "https://www.bbc.com/news/articles/c15kzd19zz5o?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 05:12:23 GMT",
  "content": "The echoing boom of a slammed door rattles around the walls of the Bank of England's grand columned entrance.\nAcross the floor and walls sprawl grand mosaics and sculptures depicting lions, piles of gold, thunderbolts and ancient Roman gods.\n\"When this building was created, it was designed as a working bank building. There were people coming and going all day,\" explains the Bank of England Museum's curator, Jenni Adam.\n\"And immediately they were greeted with this sense of grandeur along with lots and lots of messages about what's happening in this site.\"\nOne hundred years ago work began to rebuild the Bank of England - a place which had started as a townhouse in the 1700s and expanded over subsequent centuries.\nTo mark this centenary a new exhibition has begun in the bank's museum revealing more about what can be found inside one of Britain's most secure buildings.\nAhead of its opening the BBC was given a rare look inside the bank itself, where some of the country's key financial decisions are made and which houses some 400,000 bars of gold in its basement vaults.\nThe bank was first granted a Royal Charter in 1694 when it was \"founded for the use and benefit of the public as a way to manage the national debt and maintain stable finances in Britain\", says Ms Adam.\nIt proved to be a huge success and by 1734 had moved to its current position in Threadneedle Street, with the premises becoming grander and slowly swallowing up surrounding land to cover a three-and-a-half acre (14,000 sq m) site within a windowless wall.\nVarious renowned architects worked on the bank including Sir John Soane in the 1800s, with his building considered one the jewels of the City.\nHowever, by the first decades of the 20th Century, Soane's magnificent work was no longer proving fit for purpose.\n\"By the First World War the staff at the bank had gone from about 1,200 in 1914 to around 4,000 by 1918 and it was clear that there was a real capacity problem,\" says Ms Adam. \n\"It was doing a colossal job of managing an expensive national debt among many different aspects so it was decided to demolish and rebuild.\"\nDespite efforts to retain much of its historic character, the 14-year project proved controversial with one architectural expert branding the demolition \"the greatest architectural crime to befall London in the 20th Century\".\nEven so, upon its completion in 1939 the project led by chief architect Sir Herbert Baker had cost a total of £5m - the equivalent of nearly £285m today - with no expense spared in the creation of the country's central bank.\nEvidence of such wealth can be seen throughout a development which rises seven floors high and three below.\nOn the ground floor, mosaics by acclaimed Russian artist Boris Anrep spread along a maze of domed grey and black corridors, with figures and sculptures covering the fixtures and fittings throughout.\nGolden lions - symbolising security - pop up across the space, from specially designed lighting to staircase bannisters, while even the door handles are miniature recreations of Mercury, the Roman deity of communication and finance. \n\"There's a real blend of modern and ancient. It gives you the sense that even though this building is relatively new, it's been here forever,\" explains Ms Adam.\n\"There's a long legacy, a long heritage. You can trust it, it's going to stick around.\"\nThere is also a sign of an even older legacy at the bottom of one long spiralling staircase, where a Roman mosaic that was discovered in the 1930s remains on display.\nWith grand banking halls based on those from Soane's building hidden off the corridor, occasional echoing thuds and bangs are the main reminder of the working nature of the building.\nThis enterprise also carries on up another set of staircases but in a very different, almost regal atmosphere.\nOne space, the first floor anteroom, is lined with red and gold silk, with centuries-old paintings hanging on the walls and an elaborately decorative fireplace standing beside a huge floor-to-ceiling window.\nLeading off it are a thick set of wooden double-doors that head into a plush pale blue octagonal room where a portrait of a past governor glares down upon a reproduction of a room created in the 1780s.\nWithout the microphones placed around a curving table and two TV screens, few would consider this somewhere where discussions are held each month that have ramifications for millions of people.\n\"This is where to the present day, the bank's monetary policy committee meets to make decisions about rates as part of the bank's remit to manage inflation.\n\"That's why you want the double doors to make sure that nobody is listening into these very important market sensitive conversations,\" Ms Adam explains.\nThe feel of a grand old building spotted with hints of modernity continues around the floor, with many of the stone elements from the previous bank-like fireplaces and columns reused by Baker.\nThrough another set of double doors is the court room, where a branded lectern stands in front of an 18th Century fireplace beneath an elaborate green ceiling and walls lined with gold.\nSilhouettes of monarchs from across the lifetime of the bank line the room, while gilded griffins protect piles of gold above the doorways. \nA wind vane also swings mechanically on one wall recalling a time when London's port was almost on the bank's doorstep and was such a key element of the city's  economy.\n\"There's just lots of the symbolism of money and finance throughout the space... and gild as far as the eye can see,\" adds the museum curator.\nThe need for tight security means that tours of the building are incredibly rare. The only sight of any of the gold are the two bars held within the museum that are owned by the bank itself.\nIt's why Ms Adam says she's so pleased to be able to put on an exhibition to \"open up the architecture\" and give people an idea of what's inside.\n\"I've been working in the bank for 15 years and when you come in here every day, it becomes normal,\" she says.\n\"However, every so often you do go around and think 'this is so spectacular' - and there's just so many stories and details to share.\"\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, X and Instagram. Send your story ideas to hello.bbclondon@bbc.co.uk\nA consultation has been launched on proposed changes, which affect 900 roles.\nThe security guard said he was pushed aside by two men who picked up the painting and left.\nAbdelrahmen Adnan Abouelela lured his victim to a secluded spot, where he carried out the attack.\nSir Mark Rowley says the Met has not yet used live facial recognition technology at any protest.\nThe architect is remembered as having \"endless curiosity about how things are made\".\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6a81/live/9494c0e0-9224-11f0-84c8-99de564f0440.png"
}