{
  "title": "Jaguar Land Rover could face disruption until November after hack",
  "link": "https://www.bbc.com/news/articles/czewlj57e24o?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 10:11:30 GMT",
  "content": "Jaguar Land Rover (JLR) has told suppliers that production at its factories will not resume until 24 September at the earliest following a serious cyber attack, but industry sources have warned disruption could last into November.\nThe hack, which occurred more than two weeks ago, forced JLR to shut down its IT networks and paralysed production. A criminal investigation is under way.\nJLR has dismissed reports that the operational impact of the attack may continue for weeks or months as \"speculation\".\nBut concerns are growing about the impact of the stoppage on the carmaker's extensive supply chain, amid claims some companies could face bankruptcy without prompt financial support.\nThe shutdown is believed to be costing the company at least £50m a week in lost production. JLR would normally expect to build more than 1,000 cars a day.\nThe firm, which is owned by India's Tata Motors, has car plants in Solihull and Halewood, as well as an engine facility in Wolverhampton.\nIt also has large factories in Slovakia and China, as well as a smaller facility in India. \nBut all of the production lines have been at a standstill since 1 September when the hack first came to light.\nAnnouncing the latest delay, JLR said: \"We have taken this decision as our forensic investigation of the cyber incident continues and as we consider the different stages of the controlled restart of our global operations, which will take time.\n\"We are very sorry for the continued disruption this incident is causing and we will continue to update as the investigation progresses.\"\nJLR initially appeared confident that the situation would be resolved quickly. However, it has since become clear that restarting production is not a simple process.\nThe company has admitted some data may have been viewed or stolen by third parties as a result of the cyber attack. \nBy 24 September, three and a half weeks of output will have been lost. Industry insiders say that even once the production lines have restarted, getting back to normal output is likely to take several weeks.\nAmong suppliers, many of whom are small and medium sized businesses, there is growing concern.\nSeveral have told the BBC they simply do not have the financial resources to cope with an extended shutdown and industry experts have said bankruptcies are likely, unless some kind of support is provided.\nJason Richards, West Midlands regional officer at Unite the union, told the BBC: \"We're already seeing employers having discussions on potential redundancies.  People have to pay rent, they have to pay mortgages and if they're not getting any pay, what are they supposed to do?\n\"We need to have a supply chain into Jaguar Land Rover. I can't emphasise it enough [because] if they turn the tap on and they're expecting the supply chain to be waiting on the subs bench, they won't be there,\" he added.\nWith hundreds of thousands of people working in the sector, analysts say there is a risk of lasting damage to the country's engineering base.\nUnite has called for a furlough scheme to be set up, which would use government money to help pay the salaries of people in the sector who are unable to work due to the stoppage.\nThe Commons Business and Trade Committee has also asked the chancellor what plans she has to support vulnerable businesses in the supply chain. \nJLR itself is understood to have been holding talks with some suppliers about potential support.\nWhile a number of suppliers have expressed concern about a lack of information provided to them by JLR, one leading contractor has defended the company.\n\"We should not forget who is to blame here,\" said David Roberts, chair of Evtec Group.\n\"All of this is the fault of criminals. JLR is the victim here. We should remember who started this - and it wasn't JLR.\"\nA group calling itself Scattered Lapsus$ Hunters has claimed responsibility for the hack. It was also behind a number of high-profile attacks on retailers earlier this year, among them Marks & Spencer and Co-op.\nThe Cleveland Arms will become a Toby Carvery restaurant after receiving the backing of councillors.\nThe exhibition features images of trees that have been damaged by fire or explosions.\nPlas Dol-y-Moch, in Wales, is a \"huge asset\" for Coventry, the city council says.\nFour men are arrested by police who stopped the car on the Black Country Route in Wolverhampton. \nWinners include an 88-year-old preparing meals, a litter picker and a young pundit.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9ea2/live/1fcae130-92de-11f0-950e-eb051178bae0.png"
}