{
  "title": "Judge dismisses terrorism charges against Luigi Mangione",
  "link": "https://www.bbc.com/news/articles/cj4y2p8qq5qo?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 14:27:27 GMT",
  "content": "A judge in New York state has dismissed two terrorism charges against Luigi Mangione, the alleged killer of UnitedHealthcare CEO Brian Thompson.\nHowever, Judge Gregory Carro during a hearing on Tuesday morning ruled a charge of second-degree murder against Mangione could stand.\nHe said prosecutors had failed to establish that there was enough evidence to justify the terrorism-related murder charges that they sought against Mangione. \nMangione is accused of gunning down Thompson on a busy Manhattan street in December last year.\nIn a written ruling, Carro said that the allegations against Mangione did not meet the definition of terrorism under state law. \nAlthough prosecutors argued that writings left by Mangione demonstrated a terrorism motive, the judge said they failed to show that the suspect intended to put political pressure on the government or terrorise the general population - key provisions of New York's terrorism law which was passed in the wake of the 11 September 2001 attacks. \n\"There was no evidence presented that the defendant made any demands of government or sought any particular governmental policy change, let alone that he did so by intimidation or coercion,\" Carro wrote in his ruling. \nThe first-degree murder charge that was dismissed would have carried a maximum sentence of life in prison without the possibility of parole.\nIf convicted of the remaining second-degree murder charge, Mangione faces a minimum sentence of 15 to 25 years in prison. He has also been charged with weapons and forgery crimes.\nAnd in addition to the New York state criminal proceedings, Mangione also faces federal murder charges, which could lead to the death penalty.\nCarro rejected the defence team's request to delay the state trial until the conclusion of Mangione's federal trial. \nDuring the hearing on Tuesday the judge ruled that trial hearings would begin on 1 December.\nMangione has pleaded not guilty to the charges against him.\nThompson, a father of two, was the chief executive of the insurance division of  UnitedHealth Group - the largest health insurer in the US.\nHe was in New York City for a meeting when he was shot three times on a busy Manhattan street at around 6:45 a.m. on 4 December.\nAfter a five-day manhunt, Mangione was arrested about 300 miles (480km) away, at a McDonald's restaurant in Altoona, Pennsylvania.\nPolice said he left a note criticising companies profiting from the US health care system, accusing them of \"corruption and greed\".\nOutside the Manhattan Supreme Court on Tuesday a handful of Mangione's supporters gathered, some of them holding placards with slogans such as \"Free Luigi\" and \"Innocent until proven guilty\". \nThe senator from New Jersey crticised Patel during a hearing over what he claims have been repeated missteps as FBI director.\nThe 22-year-old man from Utah is set to appear in court on Tuesday to face formal charges over the killing.\nFor the first time in almost three decades Colombia loses its certification as a US ally in the war on drugs. \nUS President Donald Trump and his wife Melania are coming to the UK for an unprecedented second state visit.\nThe social media platform had faced a ban in the US over national security concerns.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a978/live/5eeb3990-930c-11f0-9cf6-cbf3e73ce2b9.jpg"
}