{
  "title": "King at Duchess of Kent's funeral but ill Queen did not attend",
  "link": "https://www.bbc.com/news/articles/cpq5eynnn8ro?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 15:18:17 GMT",
  "content": "King Charles and other senior royals have gathered with friends and family to remember Katharine, the Duchess of Kent, whose funeral was held at Westminster Cathedral.\nBut Queen Camilla sent her \"deep regrets\" at having to miss the service because she was recovering from acute sinusitis.\nThe Prince and Princess of Wales, among many who have paid warm tributes to the widely-respected, music-loving duchess, joined mourners at the Requiem Mass, alongside the Duke of Kent and his three children.\nThis is the first Catholic funeral for a member of the Royal Family in modern times - and a message from Pope Leo was read out during the service.\nThe Pope's message praised the duchess for her \"dedication to official duties, patronage of charities and devoted care for vulnerable people\" and sent his \"heartfelt condolences, together with the assurance of my prayerful closeness\" to the King, the Duke of Kent and their family.\nQueen Camilla's absence because of ill health was announced by the palace ahead of the funeral.\n\"Her thoughts and prayers will be with the Duke of Kent and all the family,\" said a statement from Buckingham Palace.\nBut the palace said that despite this painful inflammation of the sinuses, the Queen still plans to take part in the state visit of President Trump, who will be in Windsor on Wednesday.\nCrowds gathered outside the Byzantine-style church in Westminster on Tuesday afternoon as the family and friends of the duchess arrived for the funeral, which was a private service.\nPrincess Anne and her husband Sir Tim Laurence and Prince Andrew with his former wife Sarah Ferguson were among the royals attending. Sophie, Duchess of Edinburgh was at the funeral, but her husband Prince Edward was on an overseas visit.\nThere were also famous faces such as actresses Maureen Lipman and Rula Lenska and champion racing driver Sir Jackie Stewart.\nReadings at the service were given by the children and grandchildren of the duchess.\nThe coffin of the duchess had rested in front of the cathedral's altar during the Requiem Mass, draped in the royal standard and with white roses among the flowers, in honour of the duchess' Yorkshire roots.\nThe duchess was the oldest member of the Royal Family when she died earlier this month at the age of 92. She was married to the first cousin of the late Queen Elizabeth II.\nThere have been many memories of her kindness and her dedication to charities.\nCardinal Vincent Nichols, who presided over the funeral service, has spoken of how the duchess often volunteered at the Passage charity for the homeless, which is based next door to the cathedral.\nSpeaking ahead of the funeral, he remembered her as a \"very down to earth person\" who had helped in the kitchen and with cleaning at the charity.\n\"So as well as combining royal duties, she entered very wholeheartedly into serving people,\" Cardinal Nichols told the BBC.\nThis is a historic moment in terms of being a royal Catholic funeral, but the Cardinal said it should be seen primarily as a \"family funeral where the members of the family gather round\". \n\"One of their oldest members has died. A woman who was greatly loved within that family and also, as we've seen, by much of the public,\" said Cardinal Nichols.\nThe duchess had a deep love of music and had worked as a primary school music teacher, calling herself Mrs Kent, with the pupils not knowing anything about her royal life.\nMusic at the funeral included Ave Verum Corpus by Mozart, which was selected by the duchess as her favourite piece when she was a guest on the BBC's Desert Island Discs in 1990.\nA piper also played the lament Sleep, Dearie, Sleep, which was played at the funeral of the late Queen, three years ago this week.\nThere was music by JS Bach and from the requiem by French composer Maurice Durufle.\nThe duchess has been remembered as a familiar figure at the Wimbledon tennis championships, where she handed over trophies - and consoled those who had lost, including a tearful Jana Novotna in 1993.\nAfter the funeral at Westminster Cathedral, the coffin was taken to the royal burial ground in Frogmore, on the Windsor estate.\nSign up here to get the latest royal stories and analysis every week with our Royal Watch newsletter. Those outside the UK can sign up here.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/98d0/live/569ad150-930d-11f0-a647-dff301f4a439.jpg"
}