{
  "title": "Lawyers, losses and lie detectors - inside Mudryk doping case",
  "link": "https://www.bbc.com/sport/football/articles/c5yg8rgyz3no?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 13:10:28 GMT",
  "content": "Mykhailo Mudryk has not played for Chelsea in almost a year and was formally charged by the FA in June\nMykhailo Mudryk is currently suspended and unable to play for either Chelsea or Ukraine after being charged with a doping offence by the Football Association - but what is going on behind the scenes?\nThe 24-year-old winger joined Chelsea for an initial €70m (£61m) in January 2023 and has made 73 appearances for the club.\nHe was provisionally suspended in December 2024 after a urine test provided a positive result for a banned substance, and was formally charged in June.\nThe FA investigation is ongoing and the outcome, its timing, and any potential punishment all remain unclear. There is no defined time frame for doping cases - they last as long as it takes to sift through all the evidence.\nMudryk's legal defence is being managed by Morgan Sports Law, the firm who worked with former Manchester United midfielder Paul Pogba during his doping case while playing for Juventus, as well as boxer Tyson Fury and cyclist Chris Froome during their respective investigations.\nBBC Sport has taken an in-depth look at Mudryk's situation, talking to people in both Ukraine and London to find out where he is and what is going on.\nAfter news of his positive test was made public, Mudryk wrote on Instagram: \"This has come as a complete shock as I have never knowingly used any banned substances or broken any rules, and am working closely with my team to investigate how this could have happened. \n\"I know that I have not done anything wrong and remain hopeful that I will be back on the pitch soon.\"\nMudryk's legal team and those in his tight-knit circle insist he did not knowingly ingest any banned substance, and multiple sources claim he has passed an unverified lie detector test attesting to that.\nThe BBC has learned that Mudryk came into contact with the cardiovascular medication meldonium, which has the potential to increase respiratory capacity and stamina, while on duty with the Ukraine national team. \nWhen asked to verify this, the Ukrainian Football Association (UAF) did not issue a denial, but insisted none of their staff members were involved.\n\"UAF officials cannot comment on this matter, since the UAF is not a part of this case,\" it told BBC Sport. \n\"The World Anti-Doping Energy (Wada) or the English FA didn't send any request to the UAF.\n\"We are in close contact with Mudryk's lawyers and provide them with all necessary information. We cannot comment further, as a non-disclosure provision is in effect.\n\"No UAF official, staff, doctors, or coach were involved.\"\nUAF president and former Chelsea striker Andriy Shevchenko has not visited him at any point, although he also maintains a residence in London.\nIt remains unclear how exactly Mudryk apparently ingested meldonium, which has been banned by Wada since 2016 and is primarily used in Eastern European countries to treat conditions such as angina, heart failure, and coronary artery disease.\nTests at the 2015 European Games in Baku found that 13 medallists were taking the substance at the time, and that its use occurred in the majority of the sports included in the Games.\nWimbledon champion Maria Sharapova failed a drugs test in March 2016 after meldonium was detected in her sample.\nWhat is meldonium and can it enhance a footballer's performance?\nDuring the most recent international break, Ukraine's national team lost at home to France and drew away with Azerbaijan, meaning they risk missing out on qualification for the World Cup in 2026. \nTherefore, the absence of Mudryk has led to frustration and intrigue in the country.\nHis former club Shakhtar Donetsk stand to lose a potential €30m (£26m) in add-ons, which were agreed by Chelsea in addition to the upfront transfer fee.\nThe conditions for those fees are likely to never be fulfilled with Mudryk unable to play, but reports in Ukraine suggesting Shakhtar are considering suing the UAF over the potential lost earnings were described as \"nonsense\" by the club's CEO Sergei Palkin, and the club insists finances are not its primary concern.\n\"When we speak about Mudryk, we don't think about the money, we speak about the human being,\" the club's sporting director Dario Srna told BBC Sport. \n\"We feel so sorry for him. We know he is 100% innocent - he will show that.  \n\"We support him like an ex-player, a human being and a friend. We don't think the money is important.\"\nMudryk became one of Europe's most highly rated young players during his time with Shakhtar\nShakhtar CEO Palkin added: \"From time to time, I've spoken with Mudryk on the phone, and we've even met a couple of times in London. We maintain contact because he is our academy graduate and a high-profile player. \n\"Our relationship has always been good, and I felt it was important to support him morally during this period.\"\nPalkin said he had \"no idea\" how the positive test happened.\n\"Based on the information available to me, I simply cannot understand the circumstances that led to it,\" he said.\n\"I have been in contact with the UAF. I asked them to support Mudryk and requested that the lawyers handling this case respond responsibly and without delay.\n\"This situation affects the image of Ukraine and Ukrainian football as a whole. That's why, if there is any opportunity to help him, we must do so.\n\"I don't know where that information [about potentially suing the UAF] came from. It's nonsense. This idea has no basis whatsoever.\n\"I remain hopeful that this process with Mudryk will be resolved as quickly as possible, and that he will return to the pitch to continue his career.\"\nMudryk last made a public appearance after Chelsea's 4-1 Uefa Conference League final win over Real Betis, which he watched in a private capacity. \nThe 24-year-old met supporters when out walking with friends in the Polish city of Wroclaw and attended Chelsea's celebration party at the team's hotel. \nSince then Mudryk has remained in London, though he is unable to play matches or even train alongside his team-mates. \nA devout Orthodox Christian, he frequently attends church and those around him insist he is in good physical and mental health.\nThe Ukrainian is training alone with a private coach at private facilities, and his camp is confident he is doing all he can from a fitness perspective to minimise any damage to his career. \nChelsea are tracking his progress but the terms of his suspension mean he is extremely limited in the access he is allowed to the club, its facilities and his team-mates.\nMudryk last played for Chelsea on 28 November 2024 and was an unused substitute for a league match three days later against Aston Villa.\nThe club are expected to wait until the outcome of the case before commenting. \nMudryk had been an important player for Ukraine prior to his suspension, having played 28 times since making his debut in 2022\nIf Mudryk is deemed to have broken the rules, he faces of a ban of up to four years.\nThe FA treats all doping cases confidentially - that means there is no information available about where there case is up to, or what the outcome might be.\nMudryk and his legal team could potentially mount an appeal - which would be assessed by the FA's anti-doping tribunal - if he is found guilty.\nThere is also the possibility of a further appeal to the Court of Arbitration for Sport in Switzerland after that.\nIn Pogba's case, 18 months passed between his initial positive test and the date he was permitted to return to playing football after his ban was reduced on appeal.\nSo whether or not he is found guilty, fans can still expect to wait a fair while before Mudryk takes to the field for any team.\nLatest Chelsea news, analysis and fan views\nAsk about Chelsea - what do you want to know?\nChampions League: Arsenal goalless with Athletic Club on opening night of competition\nKipyegon wins historic fourth world 1500m gold\nLawyers, losses and lie detectors - inside Mudryk doping case\nRevealing the secrets of our species\nThe photo that exposed a scandalous fake injury\nThe gang who stole over £50 million from taxpayers\nIan Wright remembers an inspirational teacher\nWho will win Champions League? BBC Sport experts make predictions\nLawyers, losses and lie detectors - inside Mudryk doping case\nVegas nights with 'Rocky' Hatton's Mancunian army\nCramp cocktails and apps - how rugby tracks 'fifth vital sign'\nBack yard to brilliant - the making of Duplantis, and how high can he go?\n'What a legend!' Duplantis clears 6.30m to break world record. Video'What a legend!' Duplantis clears 6.30m to break world record\n'Have you ever seen anything like that?' Simbu wins marathon by 0.03 seconds. Video'Have you ever seen anything like that?' Simbu wins marathon by 0.03 seconds\nQuality not there - Scholes criticises Man Utd policy\n'There is, and always will be, only one Ricky Hatton'\nWhere the Manchester derby was won and lost - tactical analysis\n'Hull overcomes internal noise as Donald turns up volume for Ryder Cup'\nThe World Cup's final four - and how England can beat them\nThe world of boxing remembers legend Hatton. VideoThe world of boxing remembers legend Hatton\nSeville storms to 100m gold as Bolt cheers him on. VideoSeville storms to 100m gold as Bolt cheers him on\n'Forget Fergie time - now it's Arne Time'\n'Crawford conquers Canelo to become the face of boxing'\n'I can't change people's opinions of me' - Fernandes in his own words\nCopyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7b4c/live/cb5b5560-9307-11f0-a647-dff301f4a439.jpg"
}