{
  "title": "Mandelson red flags were missed or ignored, senior Labour MP says",
  "link": "https://www.bbc.com/news/articles/c147k2zpg68o?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 17:19:02 GMT",
  "content": "A senior Labour MP has said \"red flags were missed or ignored\" before Peter Mandelson's appointment as the UK's ambassador to the US, in an emergency debate about his sacking.\nDame Emily Thornberry, chairwoman of the Foreign Affairs Committee, said \"something went very wrong\" given Lord Mandelson's known links to convicted sex offender Jeffery Epstein.\nLord Mandelson was sacked last week after the publication of emails that showed the Labour peer had sent supportive messages to Epstein as he faced jail in 2008.\nIn the debate, the appointment was widely criticised by MPs, including Conservative leader Kemi Badenoch, who accused Prime Minister Sir Keir Starmer of \"hiding from questions\".\nBadenoch said the prime minister had \"shrivelled\" from leadership and called on him to apologise to Epstein's victims.\nOn Monday, Sir Keir said he would \"never\" have appointed Lord Mandelson if he had known the full details of his relationship with Epstein.\nThe prime minister sacked Lord Mandelson after reviewing a cache of emails between the Labour peer and Epstein.\nThe emails were published by Bloomberg after Sir Kier had expressed confidence in Lord Mandelson in Parliament, and the prime minister has insisted he did not know what was in the messages at that point.\nAn emergency debate was requested by the Conservative MP David Davis, who said the prime minister's standing had been \"diminished\" by the appointment of Lord Mandelson.\nDame Emily, who spoke in the debate, said she had asked the government questions about the vetting of Lord Mandelson and had received responses from Foreign Secretary Yvette Cooper.\nIn a letter, Cooper suggested her department was not responsible for any failure to recognise risks in the appointment of Lord Mandelson.\nShe said no concerns about Lord Mandelson were raised with the Foreign Office after a due diligence process was conducted by the Cabinet Office.\nThe Foreign Office, she said, was not asked to contribute to that process.\nHer comments throw the spotlight on the Cabinet Office and Sir Keir for their role in deciding whether Lord Mandelson was a suitable candidate.\n\"Clearly we all think [the appointment] was a mistake,\" Dame Emily told MPs.\n\"The question is, how did that mistake occur? And how do we make sure this sort of thing does not happen again because something went very wrong.\n\"When Lord Mandelson was appointed, red flags were obviously missed or ignored.\"\nDame Emily was one of the few Labour MPs who spoke in the debate, with the majority of voices coming from the opposition benches. \nOutside of Parliament, some Labour MPs have been privately and publicly critical with a few questioning if Sir Keir can stay on as prime minister. \nDuring the debate, several Conservatives criticised Sir Keir for failing to attend and sending Foreign Office minister Stephen Doughty in his place.\nLiberal Democrat Leader Sir Ed Davey said the prime minister should apologise to victims of Jeffrey Epstein.\n\"How must it have felt for the victims to see another of Epstein's closest friends made British ambassador to the United States,\" he said.\n\"How must it have felt for them to hear ministers say, even after Mandelson was sacked, that his appointment was a risk worth taking?\"\nStephen Flynn, the SNP leader in Westminster, said: \"I do not know what it is about the decades of scandals and being best friends with a notorious child trafficker and paedophile, which should have got some alarm bells ringing in No 10 before this decision was taken.\"\nAsked if the government would apologise to victims, Doughty said he had made \"very clear our position on Epstein's victims and our horror at the revelations\".\nHe said the prime minister had acted \"decisively\" in response to new information about Lord Mandelson's friendship with Epstein. \nLast week, Lord Mandelson said he \"very deeply\" regretted his friendship with Epstein, which he said he continued \"for far longer than I should have done\". \nHe said he never saw wrongdoing while with Epstein and he \"never sought, nor did [Epstein] offer introductions to women in the way that he did to others, perhaps it is because I am a gay man\".\nThe debate comes ahead of a state visit to the UK by US President Donald Trump, who is expected to arrive in the country on Tuesday evening.\nDuring the visit, the prime minister could face questions about Mandelson while standing alongside Trump, who himself had links to Epstein. \nTrump and Epstein were friends but the president has said the pair fell out in the early 2000s. \nEpstein was first criminally indicted in 2006 in Florida and pleaded guilty in 2008 to prostitution charges involving a minor. \nHe died in prison in 2019 while awaiting trial on sex trafficking charges. \nAn in-depth look at which Labour MPs are currently serving in Prime Minister Keir Starmer's cabinet. \nBusiness pauses in Cardiff Bay for tributes to the Caerphilly politician, who died last month. \nThe BBC's political editor says people at the top of government acknowledge the last few weeks have been dreadful for them.\nThe PM says a due diligence process was gone through before Lord Mandelson was appointed US ambassador.\nDowning Street said the messages about the veteran MP were \"appalling and unacceptable\". \nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4e22/live/6f455330-9301-11f0-a647-dff301f4a439.jpg"
}