{
  "title": "Sabrina Carpenter and Justin Bieber to headline Coachella 2026 ",
  "link": "https://www.bbc.com/news/articles/cr5q8zg0zy9o?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 16:28:45 GMT",
  "content": "Sabrina Carpenter, Justin Bieber and Karol G have been announced as the headliners of next year's Coachella festival.\nIt will be the first time any of the three artists have topped the bill at the event, which takes place in the Californian desert in front of about 250,000 fans.\nTeddy Swims, Katseye, Central Cee and CMAT are also on the line-up.\nThe festival, held at the Empire Polo Club in Indio, has been running since 2002 and takes place over two weekends. \nSabrina will take to the stage first on the Friday with Bieber and Karol G set to headline the Saturday and Sunday respectively.\nThere's a number of UK artists also on the bill for next year with the likes of Disclosure, Wet Leg, Lambrini Girls, Little Simz and FKA Twigs. \nTickets are not on sale yet but fans can register for passes. \nCoachella is one of the most high-profile music festivals in the world thanks to its line-up and its reputation for attracting a celebrity audience.\nLast year actor Timothee Chalamet and partner Kylie Jenner were spotted in the crowd, along with Justin Bieber and his wife Hailey.\nThe star-studded line-up included Lady Gaga, Charli XCX, Travis Scott, Post Malone and Green Day.\nThere were also complaints about a new reservation system for anyone camping at the festival, which was blamed for causing 12-hour tailbacks outside the event.\nThe line-up has been met with mixed reaction from fans.\n\"I don't think there has ever been a worse Coachella lineup in the history of the festival,” one wrote on X.\nBut others said they were already figuring out ways to bag a ticket.\nOne wrote: \"I will literally do anything for someone to sponsor my Coachella trip this line-up is so insane to me\".\nPop group AKB48 asked fans to pick their next single from a song written by humans and another by AI.\nMark Ronson looks back on a troubled childhood, and how it informed his career as a DJ and producer.\nThe director general says the corporation is \"aware of the concerns\" around Israel's participation.\nThe Australian musician says the gig in Brighton is \"going to be big, bad and beautiful.\"\nHe is the first headline artist announced for TK Maxx presents Live At Powderham in June.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/956b/live/1d37bdc0-92df-11f0-950e-eb051178bae0.jpg"
}