{
  "title": "Starmer orders investigation into MI5 after BBC exposed false evidence in spy case",
  "link": "https://www.bbc.com/news/articles/cn834zwe83lo?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 11:37:41 GMT",
  "content": "The prime minister has ordered a new investigation into how MI5 gave false evidence to three courts about conversations with the BBC.\nSir Keir Starmer's direction follows requests from the High Court and Investigatory Powers Tribunal (IPT), which both rejected MI5's explanations about what happened.\nThe case centres on a neo-Nazi state informant known as Agent X who used his MI5 role to coerce his girlfriend, whom he attacked with a machete.\nOn Tuesday, the prime minister wrote to the Investigatory Powers Commissioner Sir Brian Leveson directing him to conduct a new inquiry.\nIn a written statement to Parliament, Sir Keir said: \"I have now issued a direction to the Commissioner to commence this investigation immediately.\" \nHe said the courts \"will use the outcome of this investigation to determine their next steps in relation to the case of Agent X\".\nSir Keir noted that the relevant courts had found that MI5's investigations into the false evidence \"suffered from serious procedural deficiencies\".\nIn a letter to Sir Brian, the prime minister said the courts had \"rightly expressed their displeasure at MI5 for providing this false evidence\".\nThe investigation will be led by the Deputy Investigatory Powers Commissioner, Sir John Goldring, who will be supported by a \"small investigation team\". Sir John oversaw the Hillsborough inquests a decade ago.\nIn February, the BBC revealed that MI5 had lied to three courts while defending its handling of the misogynistic MI5 agent, whom the BBC had sought to expose in a 2022 investigation.\nArguing for secrecy, the Security Service told judges it had stuck to its policy of not confirming or denying informants' identities.\nIn fact, MI5 had disclosed the Agent X's status in phone calls to me, as it tried to persuade me not to investigate him. The service aggressively maintained its position until I produced evidence proving it was untrue, including a recording of one of the calls.\nFollowing the BBC's revelations, MI5's Director General Sir Ken McCallum apologised. Two official inquiries then took place which absolved MI5 and its officers of deliberate wrongdoing, claiming the false evidence was down to mistakes and poor memories.\nBut, in July, a panel of senior high court judges ruled that the \"investigations carried out by MI5 to date suffer from serious procedural deficiencies\" and that \"we cannot rely on their conclusions\". \nThey said it would be \"premature\" to decide whether to begin contempt of court proceedings against any MI5 officers before a new investigation took place.\nLater the same month, the IPT also rejected MI5's explanations and requested a new investigation.\nThe tribunal also said its concerns were not confined only to the possibility of contempt of court but to wider questions of whether the duty of candour was fully complied with by MI5 and the government, and whether it is possible to identify individuals who were responsible for that failure, potentially including government lawyers. \nThe duty of candour requires public bodies to be open and honest in disclosing relevant information in legal proceedings.\nIn a statement today, Sir Brian Leveson said: \"I have received Sir Ken McCallum's assurance that the inspection team will have access to legally privileged material where this is required.\"\nThe new investigation's terms of reference say it should consider the circumstances resulting in the \"provision of false evidence to both the High Court and to the Investigatory Powers Tribunal, including the degree of compliance with the duty of candour, in proceedings connected with Agent X.\"\nA Home Office spokesperson said: \"The Home Secretary is concerned that inaccurate evidence was provided to the High Court and Investigatory Powers Tribunal. The Director General of MI5 has rightly apologised for this serious failing, both publicly and to the Courts.\"\nKate Ellis, the joint head of the Centre for Women's Justice who acts for Agent X's former girlfriend, said she welcomed the prime minister's decision on further investigation.\n\"The reliance on false evidence in court is, self-evidently, profoundly serious and raises concerns that there may have been a deliberate contempt of court,\" she added.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9b10/live/c2545e70-92f4-11f0-84c8-99de564f0440.png"
}