{
  "title": "Watch: The Sundance Kid's life in the spotlight",
  "link": "https://www.bbc.com/news/videos/ce9rvmk8xdzo?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 14:09:21 GMT",
  "content": "Hollywood icon Robert Redford has died at the age of 89, his publicist has said. \nThe actor was known for his roles in blockbuster movies such as Butch Cassidy and the Sundance Kid, and went on to win an Oscar for Ordinary People when he turned his hand to directing. \nDavid Sillito looks back at his life.\nFormer US Vice-President Mike Pence calls for security guarantees in Ukraine to help deliver “just and lasting peace”.\nThe US House Oversight Committee has released new surveillance footage recorded hours before the convicted paedophile's death.\nIn an interview with BBC Newsnight, the former vice-president to Donald Trump said he would like to see negotiations to lower the levies.\nThe new detention facility inside the prison is designed to hold more than 400 undocumented immigrants convicted of serious crimes.\nJackson Denio, a 13-year-old from New Hampshire, might have set the world record for the largest catch of a halibut fish.\nThe US president made the remarks during a dinner hosting prominent tech leaders at the White House.\nTrump has said \"we're going in\", when asked about sending National Guard troops to Chicago, but does he have the power to do this?\nThe US health secretary faced questions on Covid deaths and vaccines a week after firing the head of the Centers for Disease Control and Prevention.\nThe group said they are making their own list of Jeffrey Epstein's associates and called for the release of all files related to the investigation.\n\nA fast-moving wildfire scorched the historic gold rush town of Chinese Camp destroying at least five homes and prompting evacuations.\nThe molten magma streamed down one of the world’s most active volcanoes and put on another fiery show on the Island of Hawaii.\nPresident Donald Trump says he will send the National Guard to Chicago to help fight crime but has not specified when that could occur.\nOfficers in Michigan were responding to reports of a stolen vehicle, when they deployed a grappler device around one of the car's tires.\nIn response to a reporter's question, the president said he was ‘very active’ over the Labor Day weekend. \nFletcher Merkel, 8, was one of two children killed in Wednesday's shooting at Annunciation Catholic School in Minneapolis.\nThe Garnet wildfire in Fresno County has scorched nearly 14,000 acres (5,665 hectares) and remains uncontained.\nThe BBC's Tom Bateman spoke with Patrick Scallen who lives near the Annunciation Church and ran towards the sound of gunfire.\n\nNew drone video shows rescuers rushing to the small plane off the coast of North Carolina and extracting the pilot in less than 30 seconds.\nTwo children, aged eight and 10, have been killed and 17 other people injured following a shooting during Mass.\n\nElon Musk's giant rocket, earmarked for use in a 2027 mission to the Moon, has had multiple catastrophic failures in previous launches.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0b24/live/0a01eab0-9306-11f0-84c8-99de564f0440.jpg"
}