{
  "title": "What is the President doing on his visit to the UK?",
  "link": "https://www.bbc.com/news/articles/c8rynvlm6zjo?at_medium=RSS&at_campaign=rss",
  "pubDate": "Tue, 16 Sep 2025 15:17:38 GMT",
  "content": "On Tuesday, US President Donald Trump will arrive in the UK for an unprecedented second state visit to the UK.\nTrump, who will be accompanied by his wife Melania, was hosted by the late Queen Elizabeth II in June 2019.\nA state visit is a formal trip to the UK by the head of a country. They are usually arranged at the invitation of the monarch, acting on government advice.\nAs well as being grand occasions with lots of pageantry, governments use the visits to further Britain's interests.\nTraditionally, US presidents serving a second term - such as Trump - are not offered a state visit. Instead, they are invited for tea or lunch with the monarch, as happened with former presidents Barack Obama and George W Bush. \nHowever, in February Prime Minister Sir Keir Starmer handed Trump an invitation from King Charles III during a White House meeting to discuss a UK-US trade deal. Sir Keir said the invite was \"truly historic\" and \"unprecedented\".\nTrump said it was a \"great, great honour\".\nDonald and Melania Trump will arrive in the UK on Tuesday 16 September and leave on Thursday 18 September.\nKing Charles will host the president and first lady at Windsor Castle.\nThe trip comes two months after the president spent four days in Scotland, where he met politicians and visited his golf courses. \nTuesday\nOn arrival to the UK, the Trumps will be met by the US Ambassador Warren Stephens. \nThe Viscount Hood, Lord-in-Waiting, will welcome them on behalf of the King.\nWednesday\nThe Trumps will travel to Windsor Castle where they will be greeted by the Prince and Princess of Wales, before being formally welcomed by the King and Queen. \nA royal salute will be fired in Windsor and at the Tower of London.\nFollowing lunch with members of the Royal Family, the president will visit St George's Chapel in Windsor to lay a wreath on the tomb of Queen Elizabeth II.\nLater, there will be a flypast by UK and US F-35 military jets and the Red Arrows.\nOn Wednesday evening, a traditional state banquet will be held at the castle, during which both the King and president will deliver speeches.\nThursday \nThe president will travel to the prime minister's country house Chequers, in Buckinghamshire, for a meeting with Sir Keir. \nThey will view the Sir Winston Churchill archives before holding a meeting and a press conference. \nMelania Trump will remain at Windsor Castle where she will tour the Royal Library and see Queen Mary's Dolls' House, a famous miniature palace built in the 1920s. \nShe will also meet Chief Scout Dwayne Fields with Catherine, who is joint president of the Scout Association.\nMrs Trump will then join her husband at Chequers before they return to the US. \nAccompanying Trump will be US Secretary of State Marco Rubio, Treasury Secretary Scott Bessent, special envoy Steve Witkoff, chief of staff Susie Wiles and \"other senior White House staff\". \nTrump will arrive in the UK on his customised, high-spec Boeing 747-200B aeroplane known as Air Force One.\nOnce on the ground, the president travels in Cadillac One - an enhanced limousine nicknamed the \"The Beast\".\nTwo identical versions of the presidential limousine -  as well as several other Secret Service vehicles  - are flown over to the UK in military cargo planes in advance of Trump's arrival.\nWhile Trump will make some short journeys by limousine in the UK, he is expected to do most of his travelling by air - as was the case during his trip to Scotland in July. \nThe president is likely to bring a fleet of helicopters with him including Marine One which, like Air Force One, isn't a specific aircraft but instead refers to any US Marine Corps aircraft carrying the president.\nThe president's security has been tightened in recent days following the fatal shooting of conservative activist Charlie Kirk at a university in Utah.\nThe Stop Trump coalition is planning a \"Trump Not Welcome\" demonstration in London on Wednesday 17 September. \nIt had called on the government to cancel the visit, accusing the US President of \"denying climate science\" and \"siding with war criminals - in Israel, Russia and beyond\".\nThe group organised protests in Aberdeen and Edinburgh during Trump's recent visit. Hundreds of demonstrators gathered in the two cities.\nTrump was also booed by protesters who gathered along the perimeter of his Turnberry golf course in South Ayrshire, and a paraglider flew over the resort hotel with a banner criticising his presidency.\nLiberal Democrat leader Sir Ed Davey said he would boycott the ceremonial banquet for Trump to \"send a message\" over the humanitarian crisis in Gaza.\nSince King Charles succeeded Queen Elizabeth in September 2022, he has hosted state visits from a number of international leaders and royals:\nHe and Queen Camilla have carried out state visits to France, Italy, Germany, Kenya and Samoa. \nThe senator from New Jersey crticised Patel during a hearing over what he claims have been repeated missteps as FBI director.\nOnly one of NI's leaders will attend a state banquet for the US president in London. \nThe BBC's Political Editor Chris Mason and North America Editor Sarah Smith discuss what's at stake for both sides during the trip.\nThe 22-year-old man from Utah is set to appear in court on Tuesday to face formal charges over the killing.\nFor the first time in almost three decades Colombia loses its certification as a US ally in the war on drugs. \nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9d3a/live/1ad58ef0-51b1-11f0-b52c-c776a241c026.jpg"
}